# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Dropbox\Public\PSoC_Creator\GPS_Logger\GPS_Logger.cydsn\GPS_Logger.cyprj
# Date: Sat, 14 Jul 2018 10:03:11 GMT
#set_units -time ns
create_clock -name {Clock_3(routed)} -period 100000000 -waveform {0 50000000} [list [get_pins {ClockBlock/dclk_7}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 5} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clock_4} -source [get_pins {ClockBlock/clk_sync}] -edges {1 49 97} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 241 481} [list [get_pins {ClockBlock/dclk_glb_5}]]
create_generated_clock -name {Clock_3} -source [get_pins {ClockBlock/clk_sync}] -edges {1 4800001 9600001} [list [get_pins {ClockBlock/dclk_glb_7}]]
create_generated_clock -name {UART_VMON_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 53 105} -nominal_period 1083.3333333333333 [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {UART_DEBUG_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 53 105} -nominal_period 1083.3333333333333 [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {SAKURA_SPIM_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 81 161} -nominal_period 1666.6666666666665 [list [get_pins {ClockBlock/dclk_glb_4}]]
create_generated_clock -name {UART_GPS_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 625 1251} -nominal_period 13020.833333333332 [list [get_pins {ClockBlock/dclk_glb_6}]]


# Component constraints for C:\Dropbox\Public\PSoC_Creator\GPS_Logger\GPS_Logger.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Dropbox\Public\PSoC_Creator\GPS_Logger\GPS_Logger.cydsn\GPS_Logger.cyprj
# Date: Sat, 14 Jul 2018 10:02:54 GMT
